app/Controllers/FetchMessage.php

SELECT *
FROM `messages`
WHERE   (
`receiver` = '6'
AND `sender` = '7'
 )
OR   (
`receiver` = '7'
AND `sender` = '6'
 )
ORDER BY `messages_id` ASC
---
    public function fetch()
    {
        $sender = $this->request->getPost('senderId');
        $receiver = $this->request->getPost('receiverId');

        // echo 'Sender Id: ' . $sender;
        // echo 'Receiver Id: ' . $receiver;

        $messagesModel = new MessagesModel();
        $messages = $messagesModel    ->groupStart()
        ->where('receiver', $receiver)
        ->where('sender', $sender)
        ->groupEnd()
        ->orGroupStart()
        ->where('receiver', $sender)
        ->where('sender', $receiver)
    ->groupEnd()->orderBy('messages_id', 'Asc')->findAll();