app/Controllers/MessageDetails.php

    public function send()
    {
        $senderId = $this->request->getPost('senderId');
        $receiverId = $this->request->getPost('receiverId');
        $message = $this->request->getPost('message');

        echo $message;

        $messageModel = new MessagesModel();
        $values = [
            'sender' => $senderId,
            'receiver' => $receiverId,
            'message' => $message
        ];
        $query = $messageModel->insert($values); // Fixed: insert() expects array
---
INSERT INTO `messages` (`sender`, `receiver`, `message`) VALUES ('7', '6', 'Test Message 2')

    public function fetch()
    {
        $sender = $this->request->getPost('senderId');
        $receiver = $this->request->getPost('receiverId');

        // echo 'Sender Id: ' . $sender;
        // echo 'Receiver Id: ' . $receiver;

        $messagesModel = new MessagesModel();

        $messagesModel->where('sender', $receiver)->where('receiver', $sender)->where('is_seen', 0)->set('is_seen', 1)->update();

        $message_log = $messagesModel->groupStart()
        ->where('receiver', $receiver)
        ->where('sender', $sender)
        ->groupEnd()
        ->orGroupStart()
        ->where('receiver', $sender)
        ->where('sender', $receiver)
        ->groupEnd()->orderBy('messages_id', 'Asc')->findAll();

        $login_details = new LoginDetails();
        $friend_id = $this->request->getPost('friend_id');

        $user_log = $login_details->where('user_admin_id', $receiver)->first();
---
SELECT *
FROM `messages`
WHERE   (
`receiver` = '6'
AND `sender` = '7'
 )
OR   (
`receiver` = '7'
AND `sender` = '6'
 )
ORDER BY `messages_id` ASC
SELECT *
FROM `login_details`
WHERE `user_admin_id` = '6'
 LIMIT 1

    public function updateTime(){

        // $users = array_column($this->request->getPost('users'), 'user_admin_id');

        // $current_timestamp = date('Y-m-d H:i:s');
        // $loginDetails = new LoginDetails();

        // $loginDetails->whereIn('user_admin_id', $users)->set(['last_activity' => $current_timestamp])->update();


        // $getFriendTimestamps = $loginDetails->whereIn('user_admin_id', $users)->findAll();

        $user_id = $this->request->getPost('user_id');
        $current_timestamp = date('Y-m-d H:i:s');

        $loginDetails = new LoginDetails();
        $loginDetails->where('user_admin_id', $user_id)->set('last_activity', $current_timestamp)->update();
---
UPDATE `login_details` SET `last_activity` = '2025-08-14 05:55:34'
WHERE `user_admin_id` = '6'